Show / Hide Table of Contents
Class ReferenceElement
Reference element class
Inheritance
System.Object
ReferenceElement
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ReferenceElement
Constructors
Improve this Doc   View Source
ReferenceElement()
Constructor
Declaration
public ReferenceElement()
Improve this Doc   View Source
ReferenceElement(OpenElementId)
Constructor
Declaration
public ReferenceElement(OpenElementId element)
Parameters
 Type |  Name |  Description
 OpenElementId |  element
Referenced element
Properties
Improve this Doc   View Source
Element
Referenced element
Declaration
public OpenElementId Element { get; set; }
Property Value
 Type |  Description
 OpenElementId
Improve this Doc   View Source
Id
Element Id
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
TypeName
Element type name
Declaration
public string TypeName { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source